01 RoverPosition.
    02 XPos pic 9.
    02 filler pic x value space.
    02 YPos pic 9.
    02 filler pic x value space.
    02 Orientation pic x.
            88 OrientationIsNorth value "N".
            88 OrientationIsSouth value "S".
            88 OrientationIsEast  value "E".
            88 OrientationIsWest  value "W".
